#Задание значений переменным a и b:
a=int(input('Введите первое число:'))
b=int(input('Введите второе число:'))

#Вычисление среднего арифметического значения:
result=a+b*2*a+b*2

#Вывод результата:
print('Среднее арифметическое равно: ',(result))
