#Расчёт по двум формулам
# 1. z1 = (cosa - cosb)**2 - (sina - sinb)**2;
#При a1=4 b1=1 z1=-1.1289712; a1=2 b1=5 z1=-3.0005197; a1=-1 b1=3 z1=1.3763171; a1=7 b1=9 z1=2.7123729; a1=-5 b1= z1=0.0520689;
# 2. z2 = -4sin**2 a-b/2 * cos(a=b);
#При a2=2 b2=4 z2=-2.7194842; a2=-1 b2=2 z2=-2.1503951; a2=6 b2=9 z2=3.0235465; a2=10 b2=3 z2=-0.4466412; a2=24 b2=5 z2=0.0168992;

from math import *

a1 = float(input('Введите параметр a1 = '))
b1 = float(input('Введите параметр b1 = '))
a2 = float(input('Введите параметр a2 = '))
b2 = float(input('Введите параметр b2 = '))
tmp = (a2-b2) / 2

z1 = ((cos(a1) - cos(b1)) ** 2) - ((sin(a1) - sin(b1)) ** 2)
z2 = -4 * (sin(tmp) ** 2) * (cos(a2 + b2))

print("{0:.2f} {1:.2f} {2:.4f}".format(a1, b1, z1))
print()
print("{0:.2f} {1:.2f} {2:.4f}".format(a2, b2, z2))