#Расчёт по двум формулам
# 1. z1 = cosa + cos2a + cos6a + cos7a;
#При а1=4 z1=-1.3375705; a1=2 z1=-0.0891993; a1=-1 z1=1.8382280; a1=7 z1=0.7912467; a1=-5 z1=-1.3048501;
# 2. z2 = 4cosa/2 * cos5/2a * cos4a;
#При а2=2 z2=-0.0891993; a2=-1 z2=1.8382280; a2=6 z2=1.2760752; a2=10 z2=-0.7500832; a2=24 z2=0.5800460;

from math import *

a1 = float(input('Введите параметр а1 = '))
a2 = float(input('Введите параметр а2 = '))

z1 = cos(a1) + cos(2 * a1) + cos(6 * a1) + cos(7 * a1)
z2 = 4 * cos(a2/2) * cos(5/2 * a2) * cos(4 * a2)

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))
