#Расчёт по двум формулам
# 1. z1 = sin4a / 1 + cos4a * cos2a / 1 + cos2a;
#При a1=4 z1=1.1578213; a1=2 z1=-2.1850399; a1=-1 z1=-1.5574077; a1=7 z1=0.8714480; a1=-5 z1=3.3805150;
# 2. z2 = ctg(3/2 pi - a);
#При a2=2 z2=-2.1850399; a2=-1 z2=-1.5574077; a1=6 z2=-0.2910062; a2=10 z2=0.6483608; a2=24 z2=-2.1348967;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))

z1 = sin(4 * a1) / (1 + cos(4 * a1)) * cos(2 * a1) / (1 + cos(2 * a1))
z2 = 1 / tan((3/2 * pi) - a2)

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))