#Расчёт по двум формулам
# 1. z1 = sqrt (2b + 2sqrt(b**2 - 4)) / sqrt(b**2 -4) + b + 2;
#При b1=4 z1=0.4082483; b1=2 z1=0.5000000; b1=9 z1=0.3015113; b1=7 z1=0.3333333; b1=5 z1=0.3779645;
# 2. z2 = 1 / sqrt(b + 2);
#При b2=2 z2=0.5000000; b2=-1 z2=1.0000000; b2=6 z2=0.3535534; b2=10 z2=0.2886751; b2=24 z2=0.1961161;

from math import *

b1 = float(input('Введите параметр b1 = '))
b2 = float(input('Введите параметр b2 = '))

z1 = sqrt((2 * b1) + (2 * (sqrt((b1 ** 2) - 4)))) / (sqrt((b1 ** 2) - 4) + (b1 + 2))
z2 = 1 / (sqrt(b2 + 2))

print("{0:.2f} {1:.4f}".format(b1, z1))
print()
print("{0:.2f} {1:.4f}".format(b2, z2))