#Расчёт по двум формулам
# 1. z1 = cosa + sina / cosa - sina;
#При a1=4 z1=-13.6725621; a1=2 z1=-0.3720644; a1=-1 z1=-0.2179581; a1=7 z1=14.5579044; a1=-5 z1=-1.8401543;
# 2. z2 = t2a + sec2a;
#При a2=2 z2=-0.3720644; a2=-1 z2=-0.2179581; a2=6 z2=0.5491792; a2=10 z2=4.6876485; a2=24 z2=-0.3620204;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))

z1 = (cos(a1) + sin(a1)) / (cos(a1) - sin(a1))
z2 = (tan(2 * a2) + (1 / cos(2 * a2)))

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))