#Расчёт по двум формулам
# 1. z1 = 1-2sin**2a/2ctg(pi/4+a)cos**2(pi/4-a) + e**a;
#При a1=4 z1=55.5981500; a1=2 z1=8.3890561; a1=-1 z1=1.3678794; a1=7 z1=1097.6331584; a1=-5 z1=1.0067379;
# 2. z2 = 1+e**a;
#При a2=2 z2=8.3890561; a2=-1 z2=1.3678794; a2=6 z2=404.4287935; a2=10 z2=22027.4657948; a2=24 z2=26489122130.8434715;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))
tmp = (1-(2*((sin(a1))**2)))
tmp1 = (2*(1/tan((pi/4)+a1)))
tmp2 = (cos((pi/4)-a1))**2
tmp3 = tmp1*tmp2

z1 = (tmp/tmp3) + exp(a1)
z2 = 1 + exp(a2)

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))