#Расчёт по двум формулам
# 1. z1 = 2cosa * sin2a - sina / cosa - 2 * sina * sin2a;
#При а1=4 z1=-0.63586; a1=2 z1=-0.2910062; a1=-1 z1=0.1425465; a1=7 z1=-1.5274985; a1=-5 z1=0.8559934;
# 2. z2 = tg3a;
#При а2=2 z2=-0.291006; a2=-1 z2=0.1425465; a2=6 z2=-1.1373137; a2=10 z2=-6.4053312; a2=24 z2=-0.2624174;

from math import *

a1 = float(input('Введите параметр а1 = '))
a2 = float(input('Введите параметр а2 = '))

z1 = (2 * cos(a1) * sin(2 * a1) - sin(a1)) / (cos(a1) - 2 * sin(a1) * sin(2 * a1))
z2 = tan(3 * a2)

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))