#Расчёт по двум формулам
# 1. z1 = 1 - 2sin**2a / 1 + sin2a;
#При a1=4 z1=-0.0731392; a1=2 z1=-2.6877069; a1=-1 z1=-4.5880378; a1=7 z1=0.0686912; a1=-5 z1=-0.5434327;
# 2. z2 = 1 - tga / 1 + tga;
#При a2=2 z2=-2.6877069; a2=-1 z2=-4.5880378; a1=6 z2=1.8208991; a2=10 z2=0.2133266; a2=24 z2=-2.7622749;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))

z1 = (1 - (2 * (sin(a1) ** 2))) / (1 + sin(2 * a1))
z2 = (1 - tan(a2)) / (1 + tan(a2))

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))