#Расчёт по двум формулам
# 1. 1+sin**4(-a)-cos**4(-a)/cos**2(a);
#При a1=4 z1=2.6811002; a1=2 z1=9.5487984; a1=-1 z1=4.8510376; a1=7 z1=1.5188432; a1=-5 z1=22.8557634;
# 2. 2*tg**2(a);
#При a2=2 z2=9.5487984; a2=-1 z2=4.8510376; a2=6 z2=0.1693692; a2=10 z2=0.8407435; a2=24 z2=9.1155678;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))
tmp = (sin(-a1)) ** 4
tmp1 = (cos(-a1)) ** 4
tmp2 = (cos(a1)) ** 2

z1 = (1 + tmp - tmp1) / tmp2
z2 = 2 * (tan(a2) ** 2)

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))