#Расчёт по двум формулам
# 1. z1 = 1 - 1/4sin**2 2a + cos2a;
#При а1=4 z1=0.609793; a1=2 z1=0.2031689; a1=-1 z1=0.3771477; a1=7 z1=0.8914115; a1=-5 z1=0.0869387;
# 2. z2 = cos**2 a + cos**4 a;
#При а2=2 z2=0.203169; a2=-1 z2=0.3771477; a2=6 z2=1.7718763; a2=10 z2=1.1997148; a2=24 z2=0.2123019;

from math import *

a1 = float(input('Введите параметр а1 = '))
a2 = float(input('Введите параметр а2 = '))

z1 = 1 - (1/4 * (sin(2 * a1) ** 2)) + cos(2 * a1)
z2 = (cos(a2) ** 2) + (cos(a2)**4)


print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))