#Расчёт по двум формулам
# 1. z1 = sin**2a-tg**2a / cos**2a-ctg**2a;
#При a1=4 z1=2.4090686; a1=2 z1=108.8318940; a1=-1 z1=14.2696706; a1=7 z1=0.4379745; a1=-5 z1=1492.4411285;
# 2. z2 = tg**6a;
#При a2=2 z2=108.8318940; a2=-1 z2=14.2696706; a2=6 z2=0.0006073; a2=10 z2=0.0742849; a2=24 z2=94.6806417;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))
tmp = (sin(a1))**2
tmp1 = (tan(a1))**2
tmp2 = (cos(a1))**2
tmp3 = (1/tan(a1))**2
tmp4 = (tan(a2))**6

z1 = ((tmp-tmp1)/(tmp2-tmp3))
z2 = tmp4

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))