#Расчёт по двум формулам
# 1. z1 = sina + cos(2b -a) / cosa - sin(2b -a);
#При a1=4 b1=2 z1=-0.3720644; a1=2 b1=-1 z1=-0.2179581; a1=-1 b1=6 z1=0.5491792; a1=7 b1=10 z1=4.6876485; a1=-5 b1=24 z1=-0.3620204;
# 2. z2 = 1 + sin2b / cos2b;
#При b2=2 z2=-0.3720644; b2=-1 z2=-0.2179581; b2=6 z2=0.5491792; b2=10 z2=4.6876485; b2=24 z2=-0.3620204;

from math import *

a1 = float(input('Введите параметр a1 = '))
b1 = float(input('Введите параметр b1 = '))
b2 = float(input('Введите параметр b2 = '))
tmp = 2 * b1

z1 = (sin(a1) + cos(tmp - a1)) / (cos(a1) - sin(tmp - a1))
z2 = (1 + (sin(2 * b2))) / (cos(2 * b2))

print("{0:.2f} {1:.2f} {2:.4f}".format(a1, b1, z1))
print()
print("{0:.2f} {1:.4f}".format(b2, z2))