#Расчёт по двум формулам
# 1. z1 = cos**4x + sin**2y + 1/4sin**2 2x - 1;
#При x1=4 y1=1 z1=0.9985238; x1=2 y1=5 z1=0.9545052; x1=-1 y1=3 z1=0.1101147; x1=7 y1=9 z1=0.5370196; x1=-5 y1= z1=0.9645430;
# 2. z2 = sin(y + x) * sin(y - x);
#При x2=2 y2=4 z2=-0.2540718; x2=-1 y2=2 z2=0.1187484; x2=6 y2=9 z2=0.0917686; x2=10 y2=3 z2=-0.2760441; x2=24 y2=5 z2=0.0994636;

from math import *

x1 = float(input('Введите параметр x1 = '))
y1 = float(input('Введите параметр y1 = '))
x2 = float(input('Введите параметр x2 = '))
y2 = float(input('Введите параметр y2 = '))

z1 = (cos(x1) ** 4) + (sin(y1) ** 2) + 1/4 * (sin(2 * x1 - 1) ** 2)
z2 = sin(y2 + x2) * sin(y2 - x2)

print("{0:.2f} {1:.2f} {2:.4f}".format(x1, y1, z1))
print()
print("{0:.2f} {1:.2f} {2:.4f}".format(x2, y2, z2))