#Расчёт по двум формулам
# 1. z1 = ;
#При a1=4 b1=2 c1=1 z1=2.0; a1=2 b1=2 c1=4 z1=-4.0; a1=-1 b1=5 c1=3 z1=4.5; a1=7 b1=8 c1=9 z1=-35.0; a1=-5 b1=3 c1=1 z1=22.5;
# 2. z2 = ;
#При a2=1 b2=2 c2=4 z2=-2.5; a2=-1 b2=3 c2=7 z2=5.5; a2=6 b2=4 c2=2 z2=0.0; a2=10 b2=9 c2=8 z2=-35.0; a2=24 b2=12 c2=8 z2=48.0;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))
b1 = float(input('Введите параметр b1 = '))
b2 = float(input('Введите параметр b2 = '))
c1 = float(input('Введите параметр c1 = '))
c2 = float(input('Введите параметр c2 = '))
tmp = ((1/a1) - (1/(b1+c1)))
tmp1 = ((1/a1) + (1/(b1+c1)))
pow1 = a1**2
pow2 = b1**2
pow3 = c1**2
tmp2 = (1 + ((pow2+pow3-pow1)/(2*(b1*c1))))
tmp3 = ((a1-b1-c1)/(a1*b1*c1))

z1 = (tmp/tmp1) * (tmp2) / (tmp3)
z2 = ((a2-b2-c2)/2) * a2

print("{0:.2f} {1:.2f} {2:.2f} {3:.4f}".format(a1, b1, c1, z1))
print()
print("{0:.2f} {1:.2f} {2:.2f} {3:.4f}".format(a2, b2, c2, z2))