#Расчёт по двум формулам
# 1. z1 = sin(pi/2 + 3a)/1 - sin(3a - pi);
#При a1=4 z1=1.8208991; a1=2 z1=1.3324881; a1=-1 z1=-1.1526552; a1=7 z1=-0.2982210; a1=-5 z1=-2.1723234;
# 2. z2 = ctg(5/4pi + 3/2a);
#При a2=2 z2=1.3324881; a2=-1 z2=-1.1526552; a2=6 z2=2.6517385; a2=10 z2=12.8882524; a2=24 z2=-0.7714409;

from math import *

a1 = float(input('Введите параметр a1 = '))
a2 = float(input('Введите параметр a2 = '))

z1 = (sin((pi / 2) + (3* a1))) / (1 - (sin((3 * a1) - pi)))
z2 = 1 / tan((5/4 * pi) + (3/2 *a2))

print("{0:.2f} {1:.4f}".format(a1, z1))
print()
print("{0:.2f} {1:.4f}".format(a2, z2))